CSI API ETABS v1

# cAnalyzeGetSolverOption_1 Method

---

DEPRECATED. Please see GetSolverOption_2(Int32, Int32, Int32,
String) or
[GetSolverOption_3(Int32, Int32, Int32, Int32, Int32, String)](be3d8ebc-
bc94-8008-4c90-24bc79442266.htm)

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSolverOption_1(
    	ref int SolverType,
    	ref int SolverProcessType,
    	ref bool Force32BitSolver,
    	ref string StiffCase
    )

    Function GetSolverOption_1 (
    	ByRef SolverType As Integer,
    	ByRef SolverProcessType As Integer,
    	ByRef Force32BitSolver As Boolean,
    	ByRef StiffCase As String
    ) As Integer

    Dim instance As cAnalyze
    Dim SolverType As Integer
    Dim SolverProcessType As Integer
    Dim Force32BitSolver As Boolean
    Dim StiffCase As String
    Dim returnValue As Integer

    returnValue = instance.GetSolverOption_1(SolverType,
    	SolverProcessType, Force32BitSolver,
    	StiffCase)

    int GetSolverOption_1(
    	int% SolverType,
    	int% SolverProcessType,
    	bool% Force32BitSolver,
    	String^% StiffCase
    )

    abstract GetSolverOption_1 :
            SolverType : int byref *
            SolverProcessType : int byref *
            Force32BitSolver : bool byref *
            StiffCase : string byref -> int

#### Parameters

SolverType

    Type: SystemInt32

SolverProcessType

    Type: SystemInt32

Force32BitSolver

    Type: SystemBoolean

StiffCase

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cAnalyze Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com